from match_fuzzy import match_fuzzy
Virus_database =    {
                    "Corona SARS" : {"ระบาดใน":"ไทย" 
                                  , "จำนวนคนที่ติดเชื้อ" : 100 
                                  , "จำนวนคนเสียชีวิต" : 20 }
                    ,"Corona MERS" : {"ระบาดใน":"ญี่ปุ่น" 
                                  , "จำนวนคนที่ติดเชื้อ" : 80 
                                  , "จำนวนคนเสียชีวิต" : 10 }
                }

Virus_names = Virus_database.keys() # get list of Virus Name

print("ยินดีต้อนรับสู่ฐานข้อมูล ไวรัส ของโลก")
while True:
    คำสั่ง = str(input("กรุณาเลือกคำสั่งด้วยคะ \nเพิ่มฐานข้อมูลไวรัส(1)\nลบฐานข้อมูลไวรัส(2)\nเปลี่ยนแปลงข้อมูล(3)\nเรียกดูข้อมูลไวรัส(4)\nออกจากโปรแกรม(E)"))
    if คำสั่ง == "1":
        ชื่อไวรัส = input("กรุณาพิมพ์ชื่อไวรัส")
        ระบาดใน = input("กรอกบริเวณที่ระบาด")
        จำนวนคนที่ติดเชื้อ = input("กรอกจำนวนคนที่ติดเชื้อ")
        จำนวนคนเสียชีวิต = input("กรอกจำนวนคนเสียชีวิต")
        Virus_database[ชื่อไวรัส] = {"ระบาดใน":ระบาดใน 
                                  , "จำนวนคนที่ติดเชื้อ" : จำนวนคนที่ติดเชื้อ 
                                  , "จำนวนคนเสียชีวิต" : จำนวนคนเสียชีวิต }
        print("ท่านได้ทำการเพิ่มข้อมูลไวรัส :",ชื่อไวรัส)
    elif คำสั่ง == "2":
        ชื่อไวรัส = input("กรุณาพิมพ์ชื่อไวรัส")
        ชื่อไวรัส = match_fuzzy(ชื่อไวรัส,Virus_names,score=50)
        try:
            Virus_database.pop(ชื่อไวรัส)
            print("ท่านได้ทำการลบข้อมูลไวรัส : ", ชื่อไวรัส)
        except:
            print("เกิดข้อผิดพลาด ไม่พบชื่อไวรัสดังกล่าว")
    
    elif คำสั่ง == "3": #update ข้อมูลไวรัส
        ชื่อไวรัส = input("กรุณาพิมพ์ชื่อไวรัส")
        ชื่อไวรัส = match_fuzzy(ชื่อไวรัส,Virus_names,score=50)
        try:
            Virus_database[ชื่อไวรัส][ระบาดใน] = input("ระบุบริเวณที่ระบาด")
            Virus_database[ชื่อไวรัส][จำนวนคนที่ติดเชื้อ] = input("ระบุจำนวนคนที่ติดเชื้อ")
            Virus_database[ชื่อไวรัส][จำนวนคนเสียชีวิต] = input("ระบุจำนวนคนเสียชีวิต")
            
            print("ท่านได้ทำการลบข้อมูลไวรัส : ", ชื่อไวรัส)
        except:
            print("เกิดข้อผิดพลาด ไม่พบชื่อไวรัสดังกล่าว")
    
    elif คำสั่ง == "4":
        ชื่อไวรัส = input("กรุณาพิมพ์ชื่อไวรัส")
        ชื่อไวรัส = match_fuzzy(ชื่อไวรัส,Virus_names,score=50)
        try:
            print("พบชื่อไวรัสที่ท่านทำการค้นหา")
            print(Virus_database[ชื่อไวรัส])
        except:
            print("เกิดข้อผิดพลาด ไม่พบชื่อไวรัสดังกล่าว")
            
    else:
        print(Virus_database)
        break
        